Repository: lynxnake/dzprepbuild
Catalog: libs/dzlib/tags/2011-10-02_imported-from-berlios/translations/*/dzlib.po
Languages: fr

source: no matching object found
fr: aucun objet correspondant trouvé

source: Invalid empty string value in ini file for [%s]%s
fr: Chaîne valeur non valide dans le fichier ini pour [%s]%s

source: Invalid floating point value %s in ini file for [%s]%s
fr: valeur du point flottante non valide %s dans le fichier ini pour [%s]%s

source: Invalid integer value "%s" in ini file for [%s]%s
fr: valeur entière non valide "%s" dans le fichier ini pour [%s]%s

source: Digit out of range %s
fr: Chiffre hors d'echelle %s

source: Digit #%d (%s) out of range
fr: Chiffre #%d (%s) hors d'echelle

source: "%s" is not a valid integer value: %s
fr: "%s" n'est pas une valeur décimale correcte: %s

source: "%s" is not a valid Int64 value: %s
fr: "%s" n'est pas une valeur Int64 correcte: %s

source: "%s" is not a valid floating point value: %s
fr: "%s" n'est pas une nombre décimal valable: %s

source: %.2f EiB
fr: %.2f Eio

source: %.2f PiB
fr: %.2f Pio

source: %.2f TiB
fr: %.2f Tio

source: %.2f GiB
fr: %.2f Gio

source: %.2f MiB
fr: %.2f Mio

source: %.2f KiB
fr: %.2f Kio

source: %d Bytes
fr: %d Octets

source: Length of byte array (%d) does not match size of a LongWord (%d)
fr: Longueur du tableau d'octets (%d) ne correspond pas à la taille d'un LongWord %d

source: DLL entry point not initialized
fr: DLL entrée non initialisée

source: SetParamByName is not supported for a %s (only TQuery and TAdoDataset descendants).
fr: SetParamByName n'est pas supporté pour %s (seulement TQuery et TAdoDataset descendants).

source: Monday
fr: Lundi

source: Tuesday
fr: Mardi

source: Wednesday
fr: Mercredi

source: Thursday
fr: Jeudi

source: Friday
fr: Vendredi

source: Saturday
fr: Samedi

source: Sunday
fr: Dimanche

source: Invalid value for DayOfWeek: %d
fr: Valeur non valide pour DayOfWeek: %d

source: January
fr: Janvier

source: February
fr: Février

source: March
fr: Mars

source: April
fr: Avril

source: May
fr: Mai

source: June
fr: Juin

source: July
fr: Juillet

source: August
fr: Août

source: September
fr: Septembre

source: October
fr: Octobre

source: November
fr: Novembre

source: December
fr: Décembre

source: Invalid month number %d
fr: Numéro du mois non valide %d

source: Could not load %s.
fr: Impossible de charger %s.

source: Could not find entry point %s in %s ERROR= %%d, %%s
fr: Impossible de trouver le point d'entrée %s dans %s ERROR= %%d, %%s

source: Can not free Executor while a process using redirection is still running.
fr: Impossible de libérer Executor pendant un processus utilisant redirection est toujours en cours.

source: Process has not yet been started. %s
fr: Le processus n'a pas encore commencé. %s

source: Process is still running. %s
fr: Le processus est toujours en cours. %s

source: Process has terminated. %s
fr: Processus s'est arrêté. %s

source: Process has not yet been started
fr: Processus n'a pas encore commencé

source: Process has already been started.
fr: Le processus déjà a commencé.

source: %%1:s (%%0:d) in CreateProcess("%s", "%s")
fr: %%1:s (%%0:d) dans CreateProcess("%s", "%s")

source: StdErr was not redirected
fr: StdErr n'a pas été redirigé

source: StdOut was not redirected
fr: StdOut n'a pas été redirigé

source: %%1:s (%%0:d) trying to open "%s"
fr: %%1:s (%%0:d) lors de la ouverture de "%s"

source: Invalid file attributes
fr: Attributs fichiers non valide

source: Invalid file flags
fr: Flags fichiers non valide

source: Cannot change filename when file is open.
fr: Ne peut pas changer le nom de fichier quand le fichier est ouvert.

source: Error %%1:s (%%0:d) creating directory "%s"
fr: Erreur %%1:s (%%0:d) lors de la création du répertoire "%s"

source: Could not find a unique directory name based on "%s"
fr: Impossible de trouver un nom de répertoire unique sur la base de "%s"

source: File not found: "%s"
fr: Fichier non trouvé: "%s"

source: Short pathname is longer than MAX_PATH (%d) characters
fr: La longueur du chemin de fichier dépasse MAX_PATH (%d) caractères

source: Error %%1:s (%%0:d) while trying to move "%s" to "%s".
fr: Erreur %%1:s (%%0:d) lors du déplacement de "%s" vers "%s".

source: Error %%1:s (%%0:d) while changing the readonly flag of "%s"
fr: Erreur %%1:s (%%0:d) lors du changement de l'indicateur lecture seule de "%s"

source: Error %%1:s (%%0:d) while trying to copy "%s" to "%s".
fr: Erreur %%1:s (%%0:d) lors de la copie de "%s" vers "%s".

source: Error %s (%s) in progress callback while trying to copy "%s" to "%s".
fr: Erreur %s·(%s) dans processus callback en essayant de copier "%s" vers "%s".

source: Error %%1:s (%%0:d) deleting file "%s"
fr: Erreur %%1:s (%%0:d) lors de l'effacement du fichier "%s"

source: File not found: %s
fr: Fichier non trouvé: %s

source: Directory not found: %s
fr: Répertoire non trouvé: %s

source: Error creating directory "%s": %s (%s)
fr: Erreur lors de la creation du répertoire "%s": %s (%s)

source: Error %%1:s (%%0:d) deleting directory "%s"
fr: Erreur %%1:s (%%0:d) lors de l'effacement du répertoire "%s"

source: "%s" does not exist or is not a directory
fr: "%s" n'existe pas ou n'est pas un répértoire

source: Combination of ResultContainsNumber and KeepOriginal is not allowed
fr: Combinaison de ResultContainsNumber et KeepOriginal n'est pas possible

source: unknown Registry Root Key %x
fr: inconnue · Registre · Principaux Root %x

source: unknown RegDataType
fr: inconnue RegDataType

source: unknown OS error
fr: Erreur système d'exploitation inconnue

source: Error "%1:s (%0:d)" while trying to acquire mutex.
fr: Error "%1:s (%0:d)" lors d'aquisition de mutex.

source: Entry "%s" not found.
fr: Entrée "%s" introuvable.

source: NullableDateTime is invalid
fr: NullableDateTime est non valide

source: No version information available for %s
fr: Aucune information de la version disponible pour la %s

source: New capacity cannot be less than current length.
fr: Ces nouvelles capacités ne peuvent pas être inférieure à la longueur actuelle.

source: Could not find RESOURCEDLL "%s"
fr: Impossible de trouver RESOURCEDLL "%s"

source: Could not load RESOURCEDLL "%s"
fr: Impossible de charger RESOURCEDLL "%s"

source: Could not lock RESOURCEDLL "%s"
fr: Impossible de verrouiller RESOURCEDLL "%s"

source: RESOURCEDLL "%s" is not valid (Check #1)
fr: RESOURCEDLL "%s" n'est pas valide (Check # 1)

source: RESOURCEDLL "%s" is not valid (Check #2)
fr: RESOURCEDLL "%s" n'est pas valide (Check # 2)

source: RESOURCEDLL "%s" is not valid (Check #3)
fr: RESOURCEDLL "%s" n'est pas valide (Check # 3)

source: Index %d out of bounds.
fr: Indice %d en dehors des limites.

source: Cannot calculate moving average on zero elements
fr: Impossible de calculer la moyenne mobile sur des éléments zéro

source: nthWord: 0th word not available
fr: nthWord: 0iem mot n'est pas valable

source: Cannot center string that is larger than the maximum length.
fr: Impossible de centrer une chaine qui est plus longue que la longueur maximum.

source: Strings do not have a 0th character.
fr: Chaines n'ont pas un caractère 0th.

source: Invalid file access value (%d)
fr: Valeur d'accès fichier non valide (%d)

source: %s accessing file %s
fr: %s lors de l'accès de fichier %s

source: Variant is Null, should be %s: %s
fr: La variation est nulle, devrait être %s: %s

source: Variant is Empty, should be %s: %s
fr: La variation est vide, devrait être %s: %s

source: Variant can not be converted to %s: %s
fr: La variation ne peut pas être convertie en %s: %s

source: Variant can not be converted to %s
fr: Un variant ne peut pas être converti en %s

source: Glyph string contained invalid character at position %d.
fr: Glyph chaîne contenue un caractère non valide à position %d.

source: "%s" is not a valid floating point value.
fr: "%s" n'est pas une valeur décimale correcte.

source: "%s" is not a valid integer value.
fr: "%s" n'est pas une valeur décimale correcte.

source: No item selected in combobox
fr: Aucun élément sélectionné dans combobox

source: No item selected in listbox
fr: Aucun élément sélectionné dans listbox

source: JPEG Files
fr: Fichiers JPEG

source: Invalid version part (%d)
fr: partie version non valide (%d)

source: <no version information>
fr: <pas d'information sur la version>

source: Invalid version info
fr: Info (sur la version) non valide

source: Query goes here
fr: Requête goes here

source: Cancel
fr: Annuler

source: Progress
fr: Avancement

source: Abort
fr: Annuler

source: &Next >
fr: Suiva&nt >

source: < &Previous
fr: < &Précédent

source: Invalid modal result %d.
fr: Résultat modal non valide %d.

source: Do not show again.
fr: Ne pas afficher de nouveau.

source: An error occurred: %s
fr: Une erreur est arrivé: %s

source: Additional information:
fr: Informations complémentaires:

source: &Details >>
fr: &Détails >>

source: &Details <<
fr: &Détails <<

source: Progress (%d%%)
fr: Avancement (%d%%)

source: Do you really want to abort?
fr: Voulez-vous vraiment faire abandonnerr?

source: must not contain a % at the end
fr: ne doit pas contenir un % à la fin

source: "%" must be followed by "d" or "%".
fr: "%" doit être suivi par "d" ou "%".

source: too many parameters
fr: trop de paramètres

source: Invalid FormCaption, %s
fr: FormCaption non valide, %s

source: &Finish
fr: Terminer

source: Already on first page.
fr: Déjà à la première page.

source: Invalid TNullAllowed value
fr: Valeur incorrecte TNullAllowed

source: %s is not in 'yes'/'no'
fr: %s n'est pas dan 'oui'/'non'

source: Invalid TSortOrder value
fr: Valeur incorrecte TSortOrder

source: %s is not a valid TSortOrder name
fr: %s n'est pas une TSortOrder valide

source: Invalid TFieldDataType value
fr: Valeur incorrecte TFieldDataType

source: %s is not a valid TFieldDataType name
fr: %s n'est pas une TFieldDataType valide

source: Invalid boolean value
fr: Valeur booléenne non valide

source: Data type of foreign key and primary key of referenced table do not match
fr: Type de données de clé étrangère et clé primaire de la table référencée ne correspondent pas

source: Could not append index %s. Table %s already has a primary key.
fr: Impossible d'ajouter index %s.·Table %s a déjà une clé primaire.

source: Could not append index %s. Table %s already has a index with that name.
fr: Impossible d'ajouter index %s.·Table %s a déjà un index avec ce nom.

source: Cyclic table references detected
fr: cyclique · rable · références · détecté

source: Table has no column with name "%s"
fr: Le tableau n'a pas de colonne avec le nom "%s"

source: Can not apply default %s, no variable with that name.
fr: Impossible ·d'appliquer · défaut %s, aucune variable avec ce nom.

source: There is no script named %s in this db type
fr: Il n'ya pas de script %s dans ce type db
